meatpiHQ/meatpi-components/examples/minimal/sdkconfig.defaults
# meatpi-components minimal example — ESP32-S3 with octal PSRAM
# (WiCAN Pro-class hardware; switch SPIRAM_MODE for quad-PSRAM boards)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_MAX_URI_LEN=1024

# can_manager's can_core uses the legacy driver/twai.h API (deprecation
# #warning) — don't promote default warnings to errors, and keep the
# TWAI ISR in IRAM (flash-resident ISR loses frames during flash ops).
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_TWAI_ISR_IN_IRAM_LEGACY=y
